geo_logs = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Дели', 'Индия']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit4': ['Лиссабон', 'Португалия']},
    {'visit5': ['Париж', 'Франция']},
    {'visit6': ['Лиссабон', 'Португалия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']}
]

geo_logs_russia = {} # создаем пустой словарь 
geo_logs_russia.setdefault('visit', []) # задаем ключ 'visit' в словарь geo_logs_russia
for visit in geo_logs: # для visit1, visit2, visit3 ... visit 10 из geo_logs
    for russia in visit:  # для каждого значения ключа из visit ('Москва', 'Россия'; 'Дели', 'Индия'  и т.д.)
        if 'Россия' in visit[russia]: # проверяем условие: если есть слово 'Россия' в  visit[russia] - (['Москва', 'Россия']) 
            geo_logs_russia['visit'].append(visit[russia]) # добавляем в конец нового словаря geo_logs_russia с ключом 'visit' значение  содержащее 'Россия' - ['Владимир', 'Россия'] и т.д.
print(geo_logs_russia) # {'visit': [['Москва', 'Россия'], ['Владимир', 'Россия'], ['Тула', 'Россия'], ['Тула', 'Россия'], ['Курск', 'Россия'], ['Архангельск', 'Россия']]}
   
# Эталонное решение из ответа на задание

geo_logs = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Дели', 'Индия']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit4': ['Лиссабон', 'Португалия']},
    {'visit5': ['Париж', 'Франция']},
    {'visit6': ['Лиссабон', 'Португалия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']}
]

for visit in geo_logs:
    value = list(visit.values())[0][1]
    if value == 'Россия':
        print(visit)